#Вариант 4
#Найдите ключ с минимальным значением в sample_dict = {'Physics': 82, 'Math': 65,
#'history': 75}
sample_dict = {'Physics': 82, 'Math': 65, 'history': 75}
print(sample_dict)
min_value = min(sample_dict.items())
print("Ключ с минимальным значением в данном словаре: ", min_value)
